/*****************************************************************************
@Description: PID.h PID控制头文件
@Author     : naiva
@Version    : 2025.09.17 
@History    : 2025.09.17  naiva  V2.0.1 创建
@Attention  ：
*****************************************************************************/

#ifndef __PID__H__
#define __PID__H__
#include "stdint.h"
/*-----------------------------------------------------------------------------
Default initalizer for the PIDREG3 object.
-----------------------------------------------------------------------------*/
typedef struct {
                  int       Ref;                // 输入: 给定输入
                  int       Fdb;                // 输入: 反馈输入
                  int       Err;                // 变量: 误差
                  int       Err_Max;            // 参数: 分离积分的临界点
                  int       Err_Min;            // 参数: 分离积分的临界点
                  int       Kp;                 // 参数: 比例系数
                  int       Ki;                 // 参数: 积分系数
                  int       Ui_Out_Max;         // 参数: 积分输出上限幅
                  int       Ui_Out_Min;         // 参数: 积分输出下限幅
                  int       PI_Out_Max;         // 参数: PI输出上限幅
                  int       PI_Out_Min;         // 参数: PI输出下限幅
                  int       Up;                 // 变量: 比例输出
                  int       Ui;                 // 变量: 积分输出
                  int       Out;                // 输出: PI输出
                  void      (*Calc)();          /* Pointer to calculation function */
}PID_VAR;






/*-----------------------------------------------------------------------------*/
#define PID_VOL_PARAINIT   {     0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             (void*)0 }
/*-----------------------------------------------------------------------------*/
#define PID_CURR_PARAINIT   {    0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
                                 (void*)0 }
/*-----------------------------------------------------------------------------*/
#define PID_VDCIM_PARAINIT  {    0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
		                             0,\
                                 (void*)0 }
/*-----------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------*/
/*------------------------------------------------------------------------------
------------------------------------------------------------------------------*/
extern void PID_Calc(PID_VAR *PID_Handle);
extern void PID_Para_Init( PID_VAR *VolLoop_Para_Init , PID_VAR *CurLoop_Para_Init , unsigned int Power_Level, unsigned int InvVol_Level,unsigned short int Single_Double_Flag );

extern PID_VAR PID_Vol_Loop;
extern PID_VAR PID_Curr_Loop;
extern PID_VAR PID_DCIM_Loop;
#endif /*PID_H_*/
/*-------------------------------------------------------------------------------------
 *  No more.
 *------------------------------------------------------------------------------------*/

